<?php

return [
    'Info' => 'معلومات',
    'Contact' => 'اتصل بنا',
    'P' => 'وكما تتوقع من متجر بدأ بشغفٍ بتحضير القهوة، فإننا نولي اهتمامًا دقيقًا بكل تفصيل',
    'Address' => 'الإمارات العربية المتحدة',
    'Send' => 'إرسال',
    'Name' => 'الاسم',
    'Email' => 'البريد الإلكتروني',
    'Phone' => 'رقم الهاتف',
    'Message' => 'الرسالة',
    'sent_successfully' => 'تم إرسال الرسالة بنجاح',
    'validation' => [
        'name_required'     => 'الاسم مطلوب.',
        'name_string'       => 'الاسم يجب أن يكون نصًا صالحًا.',
        'name_max'          => 'الاسم يجب ألا يتجاوز 255 حرفًا.',

        'phone_required'    => 'رقم الهاتف مطلوب.',
        'phone_string'      => 'رقم الهاتف يجب أن يكون نصًا صالحًا.',
        'phone_max'         => 'رقم الهاتف يجب ألا يتجاوز 50 حرفًا.',
        'phone_regex' => 'رقم الهاتف يجب أن يكون إماراتيًا ويبدأ بـ +971 ويتبعه الرقم بدون الصفر الأول.',

        'email_required'    => 'البريد الإلكتروني مطلوب.',
        'email_email'       => 'الرجاء إدخال بريد إلكتروني صالح.',

        'message_required'  => 'الرسالة مطلوبة.',
        'message_string'    => 'الرسالة يجب أن تكون نصًا صالحًا.',
    ],
];
